import sys

from django.core.management.base import BaseCommand
from core.models import Homograph, QuasiSynonym


homographs = {

    'абака': [
        (("капитель", 'плита', "архитектура"), 1),
        (("растение", "тропический", "банан"), 2)
    ],
    'аскер': [
        (("музыкант", 'попрошайка', "форум"), 0),
        (("солдат", "война", "турция"), 1)
    ],
    'атлас': [
        (("география", 'карта', "мир"), 0),
        (("ткань", "шелк", "шить"), 1)
    ],
    'атласный': [
        (("география", 'карта', "мир"), 0),
        (("ткань", "шелк", "шить"), 1)
    ],
    'бакан': [
        (("буй", 'море', "якорь"), 0),
        (("краска", "масло", "красить"), 1)
    ],
    'басма': [
        (("краска", 'индиго', "прическа"), 0),
        (("металл", "украшение", "кузнец"), 1)
    ],
    'безобразно': [
        (("расплывчатый", "поэзия", "нечеткий"), 1),
        (("уродливый", "проступок", "внешность"), 2)
    ],
    'безобразный': [
        (("расплывчатый", "поэзия", "нечеткий"), 1),
        (("уродливый", "проступок", "внешность"), 2)
    ],
    'благовестить': [
        (("колокол", "церковь", "слух"), 0),
        (("обрадовать", "оповестить"), 3)
    ],
    'боливар': [
        (("монета", "валюта", "деньги"), 1),
        (("шляпа", "широкополый", "мода"), 2)
    ],
    'бронзовка': [
        (("жук", "таракан", "окраска"), 0),
        (("бронза", "порошок"), 1)
    ],
    'броня': [
        (("бронирование", "забронировать", "закрепление"), 0),
        (("доспех", "война", "одежда"), 1)
    ],
    'бухание': [
        (("стучать", "ударять", "грохотать"), 0),
        (("выпивать", "алкоголь", "пить"), 1)
    ],
    'бухать': [
        (("стучать", "ударять", "грохотать"), 0),
        (("выпивать", "алкоголь", "пить"), 1)
    ],
    'бухнуть': [
        (("расшириться", "увеличиться", "влажность"), 0),
        (("выпивать", "алкоголь", "пить"), 1)
    ],
    'вантуз': [
        (("инструмент", "сантехника", "трубопровод"), 0),
        (("механизм", "сантехника", "трубопровод"), 1)
    ],
    'ведомый': [
        (("известный", "знакомый"), 0),
        (("следующий", "ведущий", "манипулировать"), 1)
    ],
    'венец': [
        (("житель", "вена", "город"), 0),
        (("венок", "драгоценность", "вершина"), 1)
    ],
    'вечерница': [
        (("растение", "цветок", "аромат"), 1),
        (("вечеринка", "деревня", "молодежь"), 2)
    ],
    'вздвоить': [
        (("удвоить", "перестроить"), 0),
        (("вспахать", "почва", "поле"), 1)
    ],
    'видение': [
        (("видеть", "восприятие"), 0),
        (("призрак", "привидение", "воображение"), 1)
    ],
    'вина': [
        (("индийский", "музыка", "струнный"), 0),
        (("преступление", "ответственность", "совесть"), 1)
    ],
    'виски': [
        (("алкоголь", "спирт", "крепкий"), 0),
        (("прическа", "стрижка", "голова"), 1)
    ],
    'воронить': [
        (("рассеянный", "невнимательный", "лениться"), 1),
        (("ржавчина", "металлический", "покрывать"), 2)
    ],
    'восхитить': [
        (("унести", "поднять", "похитить"), 1),
        (("восторг", "обрадовать", "радость"), 2)
    ],
    'восхититься': [
        (("унести", "поднять", "похитить"), 1),
        (("восторг", "обрадовать", "радость"), 2)
    ],
    'вспарить': [
        (("кипяток", "баня", "пот"), 0),
        (("взлететь", "воспарить", "подняться"), 1)
    ],
    'вспыхнуть': [
        (("зажечься", "покраснеть", "возбуждение"), 0),
        (("отдохнуть", "выздороветь", "вылечиться"), 1)
    ],
    'выводить': [
        (("прогулка", "выгуливать", "животное"), 0),
        (("направлять", "истреблять", "выращивать"), 2)
    ],
    'вывозить': [
        (("испачкать", "грязь", "вывалять"), 0),
        (("уезжать", "увозить", "экспортировать"), 2)
    ],
    'вывозиться': [
        (("испачкать", "грязь", "вывалять"), 0),
        (("уезжать", "увозить", "экспортировать"), 2)
    ],
    'выкупать': [
        (("обмыть", "искупать", "ванна"), 0),
        (("долг", "уплачивать", "освобождать"), 2)
    ],
    'выкупаться': [
        (("обмыть", "искупать", "ванна"), 0),
        (("долг", "уплачивать", "освобождать"), 2)
    ],
    'вылетать': [
        (("горючее", "полет"), 0),
        (("улетать", "подниматься", "отчисление"), 2)
    ],
    'выметать': [
        (("икра", "выбросить", "сыпь"), 0),
        (("удалять", "подметать", "сор"), 2)
    ],
    'выметаться': [
        (("икра", "выбросить", "сыпь"), 0),
        (("удалять", "подметать", "сор"), 2)
    ],
    'выносить': [
        (("роды", "износить", "обдумать"), 0),
        (("терпеть", "убирать", "доставка"), 2)
    ],
    'выноситься': [
        (("роды", "износить", "обдумать"), 0),
        (("терпеть", "убирать", "доставка"), 2)
    ],
    'высыпать': [
        (("сыпь", "выбежать", "убрать"), 0),
        (("спать", "отдых", "сон"), 2)
    ],
    'высыпаться': [
        (("сыпь", "выбежать", "убрать"), 0),
        (("спать", "отдых", "сон"), 2)
    ],
    'выходить': [
        (("вылечить", "обойти", "нянчить"), 0),
        (("уходить", "появиться"), 2)
    ],
    'вычитать': [
        (("читать", "сведение", "текст"), 0),
        (("отнимать", "вычитание"), 2)
    ],
    'вязанка': [
        (("вязать", "шерсть", "одежда"), 0),
        (("дрова", "рубить", "хворост"), 1)
    ],
    'гаванский': [
        (("гавань",), 0),
        (("куба", "столица"), 1)
    ],
    'голубить': [
        (("ласкать", "нежить", "лелеять"), 1),
        (("окрашивать", "цвет", "голубой"), 2)
    ],
    'горец': [
        (("гора", "житель"), 0),
        (("растение", "трава", "кустарник"), 1)
    ],
    'грабление': [
        (("уборка", "листья", "грабли"), 0),
        (("грабеж", "преступник", "разбой"), 1)
    ],
    'дама': [
        (("женщина", "карта", "девушка"), 0),
        (("ткань", "фасон", "шелк"), 1)
    ],
    'диаспора': [
        (("народ", "общность", "этнический"), 1),
        (("растение", "плод", "клубень"), 2)
    ],
    'добро': [
        (("ласково", "приветливо", "обнять"), 0),
        (("хороший", "удачно"), 1)
    ],
    'доброта': [
        (("добротность", "доброкачественность"), 1),
        (("доброжелательность", "отзывчивость"), 2)
    ],
    'довод': [
        (("соображение", "факт"), 0),
        (("доведение", "доводка"), 1)
    ],
    'доменный': [
        (("домна", "печь", "шахта"), 0),
        (("домен", "феодал", "владение"), 1)
    ],
    'допарить': [
        (("баня", "пропарка", "парка"), 1),
        (("летать", "долететь", "добраться"), 2)
    ],
    'досыпать': [
        (("добавить", "насыпать", "зерно"), 1),
        (("спать", "сон", "выспаться"), 2)
    ],
    'досыпаться': [
        (("добавить", "насыпать", "зерно"), 1),
        (("спать", "сон", "выспаться"), 2)
    ],
    'дохнуть': [
        (("умирать", "околевать"), 0),
        (("вдох", "выдох", "дышать"), 1)
    ],
    'жаление': [
        (("жалить", "ужалить", "жалиться"), 0),
        (("жалость", "сострадание", "успокаивать"), 1)
    ],
    'желудок': [
        (("орган", "пищеварение", "организм"), 1),
        (("желудь", "дуб"), 2)
    ],
    'желудочек': [
        (("орган", "пищеварение", "организм"), 1),
        (("желудь", "дуб"), 2)
    ],
    'забронированный': [
        (("бронирование", "забронировать", "закрепление"), 2),
        (("доспех", "война", "одежда"), 3)
    ],
    'забронировать': [
        (("бронирование", "забронировать", "закрепление"), 2),
        (("доспех", "война", "одежда"), 3)
    ],
    'забронироваться': [
        (("бронирование", "забронировать", "закрепление"), 2),
        (("доспех", "война", "одежда"), 3)
    ],
    'забухать': [
        (("стучать", "ударять", "грохотать"), 0),
        (("выпивать", "алкоголь", "пить"), 1)
    ],
    'заворот': [
        (("загиб", "перекручивание", "кишка"), 0),
        (("дорога", "изгиб", "поворот"), 1)
    ],
    'задохнуться': [
        (("затхлый", "испортиться"), 1),
        (("дышать", "умереть", "дым"), 2)
    ],
    'закликать': [
        (("кликать", "мышка", "кликание"), 1),
        (("звать", "зазывать", "глашатай"), 2)
    ],
    'замковый': [
        (("башня", 'стоять', "гора"), 0),
        (("щеколда", "открыть", "взломать"), 1)
    ],
    'замок': [
        (("башня", 'стоять', "гора"), 0),
        (("щеколда", "открыть", "взломать"), 1)
    ],
    'замыкать': [
        (("путешествовать", 'скитаться', "гулять"), 1),
        (("смыкать", "последний", "запирать"), 2)
    ],
    'замыкаться': [
        (("путешествовать", 'скитаться', "гулять"), 1),
        (("смыкать", "последний", "запирать"), 2)
    ],
    'замять': [
        (("метель", 'вьюга', "буран"), 0),
        (("сдавить", "отвлечь", "нажимать"), 1)
    ],
    'запасник': [
        (("запас", 'хранить', "музей"), 1),
        (("война", "солдат", "призвать"), 2)
    ],
    'запах': [
        (("обоняние", 'нюхать', "нос"), 0),
        (("одежда", "пальто", "закрыть"), 1)
    ],
    'запахнуть': [
        (("обоняние", 'нюхать', "нос"), 1),
        (("одежда", "пальто", "закрыть"), 2)
    ],
    'запона': [
        (("бляха", 'одежда', "украшение"), 0),
        (("передник", "фартук"), 1)
    ],
    'заспориться': [
        (("спор", 'проспорить', "пари"), 1),
        (("успешно", "удачно", "работа"), 2)
    ],
    'засыпать': [
        (("добавить", "насыпать", "зерно"), 1),
        (("спать", "сон", "выспаться"), 2)
    ],
    'засыпаться': [
        (("добавить", "насыпать", "зерно"), 1),
        (("спать", "сон", "выспаться"), 2)
    ],
    'затрусить': [
        (("испугаться", "смущение", "страх"), 1),
        (("бежать", "передвигаться", "быстро"), 2)
    ],
    'затыкать': [
        (("обращаться", "вонзать", "совать"), 1),
        (("закупоривать", "закрывать", "пробка"), 2)
    ],
    'здорово': [
        (("хорошо", "удачно", "сильно"), 0),
        (("полезно", "приветствие", "встреча"), 1)
    ],
    'зорить': [
        (("зрелость", "солнце", "ягода"), 0),
        (("разбой", "грабеж", "разорять"), 1)
    ],
    'избегать': [
        (("бегать", "место", "побывать"), 1),
        (("сторониться", "воздерживаться", "бояться"), 2)
    ],
    'ирис': [
        (("растение", "нитка", "цветок"), 0),
        (("конфета", "сладость", "кушать"), 1)
    ],
    'ирисовый': [
        (("растение", "нитка", "цветок"), 0),
        (("конфета", "сладость", "кушать"), 1)
    ],
    'искушать': [
        (("отведать", "съесть", "еда"), 1),
        (("соблазнять", "змея", "прельщать"), 2)
    ],
    'калига': [
        (("брюква", "растение", "садоводство"), 0),
        (("башмак", "обувь", "рим"), 1)
    ],
    'камора': [
        (("орудие", "снаряд", "война"), 0),
        (("знак", "рукопись", "славянский"), 1)
    ],
    'капельный': [
        (("капля", "дождь", "падать"), 0),
        (("капель", "снег", "таять"), 1)
    ],
    'карга': [
        (("отмель", "река", "плыть"), 0),
        (("старуха", "ворона", "сварливый"), 1)
    ],
    'кирка': [
        (("церковь", "лютеранство"), 0),
        (("шахта", "орудие", "копать"), 1)
    ],
    'киса': [
        (("кошка", "подзывать", "гладить"), 0),
        (("мешок", "суконный", "рюкзак"), 1)
    ],
    'колон': [
        (("ударение", "античность", "поэтика"), 0),
        (("валюта", "арендатор", "земля"), 1)
    ],
    'комплекс': [
        (("совокупность", "сочетание"), 0),
        (("математика", "умножение", "элемент"), 1)
    ],
    'комплексный': [
        (("совокупность", "сочетание"), 0),
        (("математика", "умножение", "элемент"), 1)
    ],
    'кондуктор': [
        (("травмвай", "транспорт", "автобус"), 1),
        (("офицер", "флот", "звание"), 2)
    ],
    'кондукторский': [
        (("травмвай", "транспорт", "автобус"), 1),
        (("офицер", "флот", "звание"), 2)
    ],
    'консерваторка': [
        (("демократия", "консерватизм", "консерватор"), 2),
        (("консерватория", "музыка", "женщина"), 3)
    ],
    'консерваторский': [
        (("демократия", "консерватизм", "консерватор"), 2),
        (("консерватория", "музыка"), 3)
    ],
    'кора': [
        (("скульптура", "женщина", "древнегреческий"), 0),
        (("дерево", "слой", "ствол"), 1)
    ],
    'кратер': [
        (("вулкан", "извержение", "лава"), 0),
        (("сосуд", "древнегреческий", "ваза"), 1)
    ],
    'кредит': [
        (("бухгалтерия", "расход"), 0),
        (("долг", "банк", "доверие"), 1)
    ],
    'крестовик': [
        (("растение", "рубль", "крест"), 1),
        (("паук", "ядовитый", "насекомое"), 2)
    ],
    'кули': [
        (("носильщик", "чернорабочий", "грузчик"), 0),
        (("пюре", "ягода", "фрукт"), 1)
    ],
    'кура': [
        (("курица", "животное", "ферма"), 0),
        (("вьюга", "метель", "буран"), 1)
    ],
    'ледник': [
        (("холодильник", "подвал", "скоропортящийся"), 0),
        (("лед", "полярный", "скопление"), 1)
    ],
    'ледниковый': [
        (("холодильник", "подвал", "скоропортящийся"), 0),
        (("лед", "полярный", "скопление"), 1)
    ],
    'маца': [
        (("типография", "печать"), 0),
        (("хлеб", "еврей", "лепешка"), 1)
    ],
    'мекать': [
        (("блеять", "нечленораздельно", "понимать"), 0),
        (("думать", "предполагать"), 1)
    ],
    'милование': [
        (("прощать", "вред", "отпустить"), 0),
        (("любовь", "ласкать", "целовать"), 2)
    ],
    'миловать': [
        (("прощать", "вред", "отпустить"), 0),
        (("любовь", "ласкать", "целовать"), 2)
    ],
    'миловаться': [
        (("прощать", "вред", "отпустить"), 0),
        (("любовь", "ласкать", "целовать"), 2)
    ],
    'мокрота': [
        (("гной", "легкие", "болезнь"), 1),
        (("сырость", "влажность", "дождь"), 2)
    ],
    'молодец': [
        (("герой", "храбрец", "молодой"), 0),
        (("похвалить", "одобрение", "умело"), 2)
    ],
    'морочный': [
        (("облачный", "пасмурный", "туманный"), 0),
        (("затяжной", "хлопотный", "канительный"), 1)
    ],
    'мука': [
        (("страдание", "мучение", "наказание"), 0),
        (("зерно", "хлеб", "мельница"), 1)
    ],
    'набухать': [
        (("налить", "чересчур", "переборщить"), 1),
        (("пухнуть", "переполнить", "увеличиваться"), 2)
    ],
    'навозить': [
        (("удобрять", "пачкать", "почва"), 1),
        (("привозить", "завозить", "поставка"), 2)
    ],
    'навозиться': [
        (("удобрять", "пачкать", "почва"), 1),
        (("привозить", "завозить", "поставка"), 2)
    ],
    'наволочный': [
        (("наволочка", "постель", "убирать"), 0),
        (("охота", "сеть", "птица"), 2)
    ],
    'наволочь': [
        (("облако", "туча", "туман"), 1),
        (("привозить", "собрать"), 2)
    ],
    'назубок': [
        (("напильник", "зубье", "выпиливать"), 1),
        (("наизусть", "вызубрить", "основательно"), 2)
    ],
    'нападать': [
        (("падать", "листья", "снег"), 1),
        (("нападение", "набрасываться", "вредить"), 2)
    ],
    'насыпать': [
        (("сыпучий", "рассыпать", "крупа"), 0),
        (("спать", "отдых", "сон"), 2)
    ],
    'натужиться': [
        (("напрячься", "стараться", "потеть"), 1),
        (("измучиться", "тужить"), 2)
    ],
    'недосыпать': [
        (("сыпучий", "рассыпать", "крупа"), 0),
        (("спать", "отдых", "сон"), 2)
    ],
    'недосыпаться': [
        (("сыпучий", "рассыпать", "крупа"), 0),
        (("спать", "отдых", "сон"), 2)
    ],
    'нудить': [
        (("принуждать", "заставлять"), 0),
        (("говорить", "скучный", "диалог"), 1)
    ],
    'обрамить': [
        (("окно", "рама", "вставить"), 1),
        (("окаймить", "драгоценность", "шея"), 2)
    ],
    'окорочный': [
        (("окорок", "есть", "мясо"), 0),
        (("дерево", "кора", "чистить"), 1)
    ],
    'округ': [
        (("государство", "область", "округа"), 0),
        (("вокруг"), 1)
    ],
    'оползать': [
        (("ползать", "побывать", "путешествие"), 1),
        (("оползень", "бедствие", "снег"), 2)
    ],
    'орган': [
        (("организм", "тело", "учреждение"), 0),
        (("музыка", "труба", "духовой"), 1)
    ],
    'острожник': [
        (("острог", "арестованный", "заключение"), 1),
        (("рыба", "рыболов", "острога"), 2)
    ],
    'острота': [
        (("остроумный", "сказать", "мысль"), 0),
        (("нож", "острый", "порезаться"), 1)
    ],
    'отворожить': [
        (("творог", "молоко", "сливки"), 2),
        (("ворожба", "колдовство", "спасать"), 3)
    ],
    'отгул': [
        (("отзвук", "эхо", "звучать"), 0),
        (("отпуск", "прогулять", "работа"), 1)
    ],
    'отзыв': [
        (("отклик", "рецензия", "ресторан"), 0),
        (("отозвать", "отзывать"), 1)
    ],
    'отмыкать': [
        (("мычать", "горе", "бедствовать"), 1),
        (("отпирать", "щеколда", "открывать"), 2)
    ],
    'отруб': [
        (("участок", "собственность", "земля"), 0),
        (("дерево", "сечение", "бревно"), 1)
    ],
    'отрубный': [
        (("зерно", "молоть", "мука"), 0),
        (("дерево", "сечение", "бревно"), 1)
    ],
    'пальма': [
        (("дерево", "рубить", "море"), 0),
        (("нож", "охота", "убивать"), 1)
    ],
    'пальмовый': [
        (("дерево", "рубить", "море"), 0),
        (("нож", "охота", "убивать"), 1)
    ],
    'пара': [
        (("занятие", "два", "двойка"), 0),
        (("валюта", "монета", "купить"), 1)
    ],
    'парик': [
        (("крестьянин", "оброк", "византия"), 0),
        (("волос", "накладка"), 1)
    ],
    'парить': [
        (("пар", "варить", "вода"), 0),
        (("летать", "мечтать", "фантазия"), 1)
    ],
    'парник': [
        (("котел", "спортсмен", "варить"), 0),
        (("садоводство", "рассада", "теплица"), 1)
    ],
    'пахнуть': [
        (("запах", "дышать", "вонять"), 0),
        (("обдать", "струя"), 1)
    ],
    'передохнуть': [
        (("умирать", "околевать"), 2),
        (("вдох", "выдох", "дышать"), 3)
    ],
    'перекрест': [
        (("христианство", "религия", "вера"), 0),
        (("повязать", "накрест"), 1)
    ],
    'перетрусить': [
        (("испугаться", "струсить", "страх"), 2),
        (("перетрясти", "труха", "очистить"), 3)
    ],
    'перетруситься': [
        (("испугаться", "струсить", "страх"), 2),
        (("перетрясти", "труха", "очистить"), 3)
    ],
    'перловый': [
        (("жемчужина", "изумруд", "драгоценность"), 0),
        (("перловка", "каша", "есть"), 1)
    ],
    'пестрина': [
        (("пятно", "крапина"), 1),
        (("пестрый", "разноцветный"), 2)
    ],
    'пикирование': [
        (("снижаться", "самолет", "падать"), 1),
        (("садоводство", "пересадка", "растение"), 3)
    ],
    'пикировать': [
        (("снижаться", "самолет", "падать"), 1),
        (("садоводство", "пересадка", "растение"), 3)
    ],
    'пикироваться': [
        (("снижаться", "самолет", "падать"), 1),
        (("садоводство", "пересадка", "растение"), 3)
    ],
    'пикник': [
        (("телосложение", "человек", "тело"), 0),
        (("есть", "прогулка", "закуска"), 1)
    ],
    'пильня': [
        (("пилить", "дерево", "лес"), 0),
        (("звук", "резкий", "ухо"), 1)
    ],
    'плотик': [
        (("плот", "плавать", "флот"), 0),
        (("камень", "россыпь", "гора"), 1)
    ],
    'подать': [
        (("налог", "крестьянин", "платить"), 1),
        (("принести", "доставить", "милостыня"), 3)
    ],
    'позасыпать': [
        (("добавить", "насыпать", "зерно"), 2),
        (("спать", "сон", "выспаться"), 3)
    ],
    'полоть': [
        (("мясо", "туша", "рубить"), 0),
        (("очищать", "огород", "сорняк"), 1)
    ],
    'полузасыпать': [
        (("добавить", "насыпать", "зерно"), 2),
        (("спать", "сон", "выспаться"), 3)
    ],
    'помыкать': [
        (("странствовать", "путешествие", "горе"), 1),
        (("распоряжяться", "насилие", "унижать"), 2)
    ],
    'попадать': [
        (("упасть", "падать", "падение"), 1),
        (("меткий", "стрелять", "бросать"), 2)
    ],
    'пора': [
        (("кожа", "организм", "пустота"), 0),
        (("эпоха", "время", "наступить"), 1)
    ],
    'порскать': [
        (("смех", "броситься", "смеяться"), 0),
        (("натравить", "собака", "охота"), 1)
    ],
    'порскнуть': [
        (("смех", "броситься", "смеяться"), 0),
        (("натравить", "собака", "охота"), 1)
    ],
    'потупить': [
        (("опустить", "взгляд", "смутиться"), 1),
        (("затупить", "тупой", "острый"), 2)
    ],
    'почесть': [
        (("награда", "слава", "заслужить"), 0),
        (("признать", "поступок", "почти"), 1)
    ],
    'правило': [
        (("условие", "послушание", "правильный"), 0),
        (("линейка", "штукатурка", "весло", "хвост"), 1)
    ],
    'правление': [
        (("исправление", "исправить", "ошибка"), 0),
        (("управлять", "государство", "правительство"), 1)
    ],
    'префикс': [
        (("лингвистика", "приставка", "слово"), 0),
        (("платить", "вексель", "кредит"), 1)
    ],
    'приступ': [
        (("эпилепсия", "штурм", "приступать"), 0),
        (("ступенька", "лестница", "подниматься"), 1)
    ],
    'пробел': [
        (("иконопись", "белило", "изображение"), 0),
        (("промежуток", "клавиатура", "пустота"), 1)
    ],
    'провидение': [
        (("предвидеть", "будущее", "гадалка"), 1),
        (("божественный", "судьба", "религия"), 2)
    ],
    'провод': [
        (("шнур", "компьютер", "зарядка"), 0),
        (("провожать", "проводить", "прощание"), 1)
    ],
    'проезд': [
        (("лошадь", "шаг"), 0),
        (("ехать", "переулок", "миновать"), 1)
    ],
    'пролог': [
        (("церковь", "учение", "святой"), 0),
        (("эпилог", "введение", "начало"), 1)
    ],
    'пропасть': [
        (("обрыв", "бездна", "лететь"), 0),
        (("исчезнуть", "потеряться", "смерть"), 1)
    ],
    'простыня': [
        (("человек", "простодушный", "блаженный"), 0),
        (("одеяло", "полотенце", "заправлять"), 1)
    ],
    'просыпать': [
        (("добавить", "насыпать", "зерно"), 1),
        (("спать", "сон", "выспаться"), 2)
    ],
    'пустошка': [
        (("пустошь", "степь", "путешествовать"), 0),
        (("сова", "птица", "удод"), 1)
    ],
    'пьяница': [
        (("пропойца", "выпивать", "алкоголь"), 1),
        (("голубика", "ягода", "выращивать"), 2)
    ],
    'рассорить': [
        (("ссора", "поссорить", "конфликт"), 1),
        (("рассыпать", "потратить", "деньги"), 2)
    ],
    'ратовать': [
        (("сражаться", "голосовать", "поддерживать"), 0),
        (("спасать", "опасность", "помогать"), 1)
    ],
    'респиратор': [
        (("атомный", "маска", "надевать"), 1),
        (("легкие", "заболевание", "болеть"), 2)
    ],
    'рисовка': [
        (("птица", "летать", "рисовый"), 0),
        (("изображение", "стиль", "рисовать"), 1)
    ],
    'рондо': [
        (("музыка", "инструментальный", "повторять"), 0),
        (("стихотворение", "шрифт", "писать"), 1)
    ],
    'саванный': [
        (("одежда", "усопший", "надеть"), 0),
        (("пустыня", "саванна", "путешествовать"), 1)
    ],
    'сажалка': [
        (("водоем", "рыба", "ловить"), 0),
        (("картофель", "посадка", "садоводство"), 1)
    ],
    'салма': [
        (("пролив", "остров", "плавать"), 0),
        (("еда", "лапша", "кушать"), 1)
    ],
    'свариться': [
        (("браниться", "ссориться", "конфликт"), 0),
        (("приготовить", "варить", "сварка"), 1)
    ],
    'свойство': [
        (("особенность", "черта", "признак"), 0),
        (("отношение", "супруг", "брак"), 1)
    ],
    'сволочь': [
        (("негодяй", "человек", "бранить"), 0),
        (("тащить", "волочить", "тяжесть"), 1)
    ],
    'сенсорный': [
        (("экран", "телефон", "разблокировать"), 0),
        (("чувство", "почувствовать", "обоняние"), 1)
    ],
    'сервировать': [
        (("теннис", "волейбол", "подача"), 1),
        (("накрывать", "обед", "сервиз"), 2)
    ],
    'сима': [
        (("кора", "земля", "оболочка"), 0),
        (("рыба", "лосось", "плавать"), 1)
    ],
    'скучить': [
        (("сложить", "объединить", "куча"), 0),
        (("ныть", "скулить", "горе"), 1)
    ],
    'сладить': [
        (("смастерить", "строительство", "строить"), 0),
        (("сладкий", "сластить", "чай"), 1)
    ],
    'спешить': [
        (("спешиться", "приказать", "лошадь"), 0),
        (("торопиться", "спешка", "опаздывать"), 1)
    ],
    'спориться': [
        (("спорить", "возражать", "доказательство"), 0),
        (("успешно", "работа", "удаваться"), 1)
    ],
    'старик': [
        (("птица", "летать", "воздух"), 0),
        (("мужчина", "старый", "жить"), 1)
    ],
    'старина': [
        (("былина", "народный", "песня"), 0),
        (("старый", "давно", "человек"), 2)
    ],
    'старшина': [
        (("казачество", "украина", "восстание"), 1),
        (("звание", "армия", "офицер"), 2)
    ],
    'старшинство': [
        (("звание", "армия", "офицер"), 1),
        (("первенство", "возраст", "старый"), 2)
    ],
    'струсить': [
        (("испугаться", "струсить", "страх"), 0),
        (("перетрясти", "труха", "очистить"), 1)
    ],
    'ступа': [
        (("сосуд", "пест", "толочь"), 0),
        (("походка", "поступь", "торопиться"), 1)
    ],
    'ступень': [
        (("лапоть", "обувь", "крестьянин"), 0),
        (("лестница", "выступ", "подниматься"), 1)
    ],
    'сытить': [
        (("сытный", "насыщать", "еда"), 0),
        (("сластить", "сладкий", "сахар"), 1)
    ],
    'таинственный': [
        (("таинство", "церковный", "обряд"), 0),
        (("тайна", "загадочный", "раскрыть"), 1)
    ],
    'тамбур': [
        (("вагон", "архитектура", "купол", "вышивание", "транспорт"), 0),
        (("инструмент", "музыка", "петь"), 1)
    ],
    'таро': [
        (("растение", "тропики", "садоводство"), 0),
        (("гадать", "карта", "пророчество"), 1)
    ],
    'тикать': [
        (("постукивать", "часы", "тихий"), 0),
        (("убегать", "удирать", "быстро"), 1)
    ],
    'травщик': [
        (("металл", "шахта", "работа"), 0),
        (("собиратель", "садоводство", "растение"), 1)
    ],
    'транспорт': [
        (("испугаться", "струсить", "страх"), 0),
        (("бухгалтерия",), 1)
    ],
    'транспортный': [
        (("испугаться", "струсить", "страх"), 0),
        (("бухгалтерия",), 1)
    ],
    'трусить': [
        (("испугаться", "струсить", "страх"), 0),
        (("перетрясти", "труха", "очистить", "ехать", "лошадь"), 1)
    ],
    'трухнуть': [
        (("труха", "гниль", "испортиться"), 0),
        (("струсить", "испугаться", "страх"), 1)
    ],
    'тупик': [
        (("птица", "летать", "воздух"), 0),
        (("переулок", "выход", "безвыходный"), 1)
    ],
    'тупиковый': [
        (("птица", "летать", "воздух"), 0),
        (("переулок", "выход", "безвыходный"), 2)
    ],
    'тырса': [
        (("ковыль", "злак", "садоводство"), 0),
        (("опилки", "посыпать", "манеж"), 1)
    ],
    'угольник': [
        (("уголь", "работать", "угольщик"), 0),
        (("геометрия", "чертить", "угол"), 1)
    ],
    'ужин': [
        (("вечер", "пища", "есть"), 0),
        (("хлеб", "поле", "собирать"), 1)
    ],
    'ужинать': [
        (("вечер", "пища", "есть"), 0),
        (("серп", "поле", "собирать"), 2)
    ],
    'умыкать': [
        (("мучить", "страдание", "унижать"), 1),
        (("похищение", "воровать", "кража"), 2)
    ],
    'умыкаться': [
        (("мучить", "страдание", "унижать"), 1),
        (("похищение", "воровать", "кража"), 2)
    ],
    'утопать': [
        (("топать", "уходить", "рыхдый"), 1),
        (("тонуть", "корабль", "плавать"), 2)
    ],
    'фанза': [
        (("дом", "китай", "крестьянин"), 0),
        (("материал", "шелк", "тафта"), 1)
    ],
    'фанзовый': [
        (("дом", "китай", "крестьянин"), 0),
        (("материал", "шелк", "тафта"), 1)
    ],
    'фиговый': [
        (("дерево", "инжир", "садоводство"), 0),
        (("плохой", "качественный", "работа"), 1)
    ],
    'фистула': [
        (("язва", "организм", "болеть"), 0),
        (("фальцет", "петь", "высокий"), 2)
    ],
    'характерный': [
        (("упрямый", "послушный", "характер"), 1),
        (("особенность", "свойство", "выражать"), 2)
    ],
    'хлопок': [
        (("растение", "садоводство", "выращивать"), 0),
        (("ладонь", "хлопать", "звук"), 1)
    ],
    'холуй': [
        (("живопись", "рисовать", "миниатюра"), 0),
        (("оскорбление", "называть", "слуга"), 1)
    ],
    'цапать': [
        (("хватать", "коготь", "царапаться", "своровать"), 0),
        (("разрыхлять", "почва", "садоводство"), 1)
    ],
    'целение': [
        (("мишень", "целиться", "выстрел"), 0),
        (("исцеление", "вылечить", "лекарь"), 1)
    ],
    'целить': [
        (("мишень", "целиться", "выстрел"), 0),
        (("исцеление", "вылечить", "лекарь"), 1)
    ],
    'целиться': [
        (("мишень", "целиться", "выстрел"), 0),
        (("исцеление", "вылечить", "лекарь"), 1)
    ],
    'чернеть': [
        (("птица", "утка", "летать"), 0),
        (("черный", "почернеть"), 1)
    ],
    'чудно': [
        (("радоваться", "прекрасно", "замечательный"), 0),
        (("необычно", "удивляться", "поразительно"), 1)
    ],
    'шабаш': [
        (("ведьма", "средневековье"), 0),
        (("отдыхать", "отгул", "отпуск"), 1)
    ],
    'шикнуть': [
        (("подозвать", "произнести", "шипение"), 0),
        (("шик", "щеколять", "хвастливый"), 1)
    ],
    'электрик': [
        (("электричество", "специалист", "электротехник"), 1),
        (("цвет", "красить", "стиль"), 2)
    ],
}


def add_homographs():

    for hom in homographs:
        homograph, created = Homograph.objects.get_or_create(
            homograph=hom
        )
        if created:
            for quasi in homographs[hom]:
                QuasiSynonym.objects.create(
                    homograph=homograph,
                    stress=quasi[1],
                    synonyms=list(quasi[0])
                )
            print(f'Добавлен {hom}')


class Command(BaseCommand):
    help = 'Добавление омографов'

    def handle(self, *args, **options):

        add_homographs()
