from django.core.management.base import BaseCommand
from core.models import Homograph, QuasiSynonym


homographs = {

    'абака': [
        (("капитель", 'плита', "архитектура"), 1),
        (("растение", "тропический", "банан"), 2)
    ],
    'замок': [
        (("башня", 'стоять', "гора"), 0),
        (("щеколда", "открыть", "взломать"), 1)
    ],
    'аскер': [
        (("музыкант", 'попрошайка', "форум"), 0),
        (("солдат", "война", "турция"), 1)
    ],
    'атлас': [
        (("география", 'карта', "мир"), 0),
        (("ткань", "шелк", "шить"), 1)
    ],
    'атласный': [
        (("география", 'карта', "мир"), 0),
        (("ткань", "шелк", "шить"), 1)
    ],
    'бакан': [
        (("буй", 'море', "якорь"), 0),
        (("краска", "масло", "красить"), 1)
    ],
    'басма': [
        (("краска", 'индиго', "прическа"), 0),
        (("металл", "украшение", "кузнец"), 1)
    ],
    'безобразно': [
        (("расплывчатый", "поэзия", "нечеткий"), 1),
        (("уродливый", "проступок", "внешность"), 2)
    ],
    'безобразный': [
        (("расплывчатый", "поэзия", "нечеткий"), 1),
        (("уродливый", "проступок", "внешность"), 2)
    ],
    'благовестить': [
        (("колокол", "церковь", "слух"), 0),
        (("обрадовать", "оповестить"), 3)
    ],
    'боливар': [
        (("монета", "валюта", "деньги"), 1),
        (("шляпа", "широкополый", "мода"), 2)
    ],
    'бронзовка': [
        (("жук", "таракан", "окраска"), 0),
        (("бронза", "порошок"), 1)
    ],
    'броня': [
        (("бронирование", "забронировать", "закрепление"), 0),
        (("доспех", "война", "одежда"), 1)
    ],
    'бухание': [
        (("стучать", "ударять", "грохотать"), 0),
        (("выпивать", "алкоголь", "пить"), 1)
    ],
    'бухать': [
        (("стучать", "ударять", "грохотать"), 0),
        (("выпивать", "алкоголь", "пить"), 1)
    ],
    'бухнуть': [
        (("расшириться", "увеличиться", "влажность"), 0),
        (("выпивать", "алкоголь", "пить"), 1)
    ],
    'вантуз': [
        (("инструмент", "сантехника", "трубопровод"), 0),
        (("механизм", "сантехника", "трубопровод"), 1)
    ],
    'ведомый': [
        (("известный", "знакомый"), 0),
        (("следующий", "ведущий", "манипулировать"), 1)
    ],
    'венец': [
        (("житель", "вена", "город"), 0),
        (("венок", "драгоценность", "вершина"), 1)
    ],
    'вечерница': [
        (("растение", "цветок", "аромат"), 1),
        (("вечеринка", "деревня", "молодежь"), 2)
    ],
    'вздвоить': [
        (("удвоить", "перестроить"), 0),
        (("вспахать", "почва", "поле"), 1)
    ],
    'видение': [
        (("видеть", "восприятие"), 0),
        (("призрак", "привидение", "воображение"), 1)
    ],
    'вина': [
        (("индийский", "музыка", "струнный"), 0),
        (("преступление", "ответственность", "совесть"), 1)
    ],
    'виски': [
        (("алкоголь", "спирт", "крепкий"), 0),
        (("прическа", "стрижка", "голова"), 1)
    ],
    'воронить': [
        (("рассеянный", "невнимательный", "лениться"), 1),
        (("ржавчина", "металлический", "покрывать"), 2)
    ],
    'восхитить': [
        (("унести", "поднять", "похитить"), 1),
        (("восторг", "обрадовать", "радость"), 2)
    ],
    'восхититься': [
        (("унести", "поднять", "похитить"), 1),
        (("восторг", "обрадовать", "радость"), 2)
    ],
    'вспарить': [
        (("кипяток", "баня", "пот"), 0),
        (("взлететь", "воспарить", "подняться"), 1)
    ],
    'вспыхнуть': [
        (("зажечься", "покраснеть", "возбуждение"), 0),
        (("отдохнуть", "выздороветь", "вылечиться"), 1)
    ],
    'выводить': [
        (("прогулка", "выгуливать", "животноеК"), 0),
        (("направлять", "истреблять", "выращивать"), 2)
    ],
    'вывозить': [
        (("испачкать", "грязь", "вывалять"), 0),
        (("уезжать", "увозить", "экспортировать"), 2)
    ],
    'вывозиться': [
        (("испачкать", "грязь", "вывалять"), 0),
        (("уезжать", "увозить", "экспортировать"), 2)
    ],
    'выкупать': [
        (("обмыть", "искупать", "ванна"), 0),
        (("долг", "уплачивать", "освобождать"), 2)
    ],
    'выкупаться': [
        (("обмыть", "искупать", "ванна"), 0),
        (("долг", "уплачивать", "освобождать"), 2)
    ],
    'вылетать': [
        (("горючее", "полет"), 0),
        (("улетать", "подниматься", "отчисление"), 2)
    ],
    'выметать': [
        (("икра", "выбросить", "сыпь"), 0),
        (("удалять", "подметать", "сор"), 2)
    ],
    'выметаться': [
        (("икра", "выбросить", "сыпь"), 0),
        (("удалять", "подметать", "сор"), 2)
    ],
    'выносить': [
        (("роды", "износить", "обдумать"), 0),
        (("терпеть", "убирать", "доставка"), 2)
    ],
    'выноситься': [
        (("роды", "износить", "обдумать"), 0),
        (("терпеть", "убирать", "доставка"), 2)
    ],
    'высыпать': [
        (("сыпь", "выбежать", "убрать"), 0),
        (("спать", "отдых", "сон"), 2)
    ],
    'высыпаться': [
        (("сыпь", "выбежать", "убрать"), 0),
        (("спать", "отдых", "сон"), 2)
    ],
    'выходить': [
        (("вылечить", "обойти", "нянчить"), 0),
        (("уходить", "появиться"), 2)
    ],
    'вычитать': [
        (("читать", "сведение", "текст"), 0),
        (("отнимать", "вычитание"), 2)
    ],
    'вязанка': [
        (("вязать", "шерсть", "одежда"), 0),
        (("дрова", "рубить", "хворост"), 1)
    ],
}


def add_homographs():

    for hom in homographs:
        homograph, created = Homograph.objects.get_or_create(
            homograph=hom
        )
        if created:
            for quasi in homographs[hom]:
                QuasiSynonym.objects.create(
                    homograph=homograph,
                    stress=quasi[1],
                    synonyms=quasi[0]
                )


class Command(BaseCommand):
    help = 'Добавление омографов'

    def handle(self, *args, **options):

        add_homographs()
