import sys

from django.core.management.base import BaseCommand
from core.models import Homograph, QuasiSynonym


homographs = {

    'абака': [
        (("капитель", 'плита', "архитектура"), 1),
        (("растение", "тропический", "банан"), 2)
    ],
    'аскер': [
        (("музыкант", 'попрошайка', "форум"), 0),
        (("солдат", "война", "турция"), 1)
    ],
    'атлас': [
        (("география", 'карта', "мир"), 0),
        (("ткань", "шелк", "шить"), 1)
    ],
    'атласный': [
        (("география", 'карта', "мир"), 0),
        (("ткань", "шелк", "шить"), 1)
    ],
    'бакан': [
        (("буй", 'море', "якорь"), 0),
        (("краска", "масло", "красить"), 1)
    ],
    'басма': [
        (("краска", 'индиго', "прическа"), 0),
        (("металл", "украшение", "кузнец"), 1)
    ],
    'безобразно': [
        (("расплывчатый", "поэзия", "нечеткий"), 1),
        (("уродливый", "проступок", "внешность"), 2)
    ],
    'безобразный': [
        (("расплывчатый", "поэзия", "нечеткий"), 1),
        (("уродливый", "проступок", "внешность"), 2)
    ],
    'благовестить': [
        (("колокол", "церковь", "слух"), 0),
        (("обрадовать", "оповестить"), 3)
    ],
    'боливар': [
        (("монета", "валюта", "деньги"), 1),
        (("шляпа", "широкополый", "мода"), 2)
    ],
    'бронзовка': [
        (("жук", "таракан", "окраска"), 0),
        (("бронза", "порошок"), 1)
    ],
    'броня': [
        (("бронирование", "забронировать", "закрепление"), 0),
        (("доспех", "война", "одежда"), 1)
    ],
    'бухание': [
        (("стучать", "ударять", "грохотать"), 0),
        (("выпивать", "алкоголь", "пить"), 1)
    ],
    'бухать': [
        (("стучать", "ударять", "грохотать"), 0),
        (("выпивать", "алкоголь", "пить"), 1)
    ],
    'бухнуть': [
        (("расшириться", "увеличиться", "влажность"), 0),
        (("выпивать", "алкоголь", "пить"), 1)
    ],
    'вантуз': [
        (("инструмент", "сантехника", "трубопровод"), 0),
        (("механизм", "сантехника", "трубопровод"), 1)
    ],
    'ведомый': [
        (("известный", "знакомый"), 0),
        (("следующий", "ведущий", "манипулировать"), 1)
    ],
    'венец': [
        (("житель", "вена", "город"), 0),
        (("венок", "драгоценность", "вершина"), 1)
    ],
    'вечерница': [
        (("растение", "цветок", "аромат"), 1),
        (("вечеринка", "деревня", "молодежь"), 2)
    ],
    'вздвоить': [
        (("удвоить", "перестроить"), 0),
        (("вспахать", "почва", "поле"), 1)
    ],
    'видение': [
        (("видеть", "восприятие"), 0),
        (("призрак", "привидение", "воображение"), 1)
    ],
    'вина': [
        (("индийский", "музыка", "струнный"), 0),
        (("преступление", "ответственность", "совесть"), 1)
    ],
    'виски': [
        (("алкоголь", "спирт", "крепкий"), 0),
        (("прическа", "стрижка", "голова"), 1)
    ],
    'воронить': [
        (("рассеянный", "невнимательный", "лениться"), 1),
        (("ржавчина", "металлический", "покрывать"), 2)
    ],
    'восхитить': [
        (("унести", "поднять", "похитить"), 1),
        (("восторг", "обрадовать", "радость"), 2)
    ],
    'восхититься': [
        (("унести", "поднять", "похитить"), 1),
        (("восторг", "обрадовать", "радость"), 2)
    ],
    'вспарить': [
        (("кипяток", "баня", "пот"), 0),
        (("взлететь", "воспарить", "подняться"), 1)
    ],
    'вспыхнуть': [
        (("зажечься", "покраснеть", "возбуждение"), 0),
        (("отдохнуть", "выздороветь", "вылечиться"), 1)
    ],
    'выводить': [
        (("прогулка", "выгуливать", "животное"), 0),
        (("направлять", "истреблять", "выращивать"), 2)
    ],
    'вывозить': [
        (("испачкать", "грязь", "вывалять"), 0),
        (("уезжать", "увозить", "экспортировать"), 2)
    ],
    'вывозиться': [
        (("испачкать", "грязь", "вывалять"), 0),
        (("уезжать", "увозить", "экспортировать"), 2)
    ],
    'выкупать': [
        (("обмыть", "искупать", "ванна"), 0),
        (("долг", "уплачивать", "освобождать"), 2)
    ],
    'выкупаться': [
        (("обмыть", "искупать", "ванна"), 0),
        (("долг", "уплачивать", "освобождать"), 2)
    ],
    'вылетать': [
        (("горючее", "полет"), 0),
        (("улетать", "подниматься", "отчисление"), 2)
    ],
    'выметать': [
        (("икра", "выбросить", "сыпь"), 0),
        (("удалять", "подметать", "сор"), 2)
    ],
    'выметаться': [
        (("икра", "выбросить", "сыпь"), 0),
        (("удалять", "подметать", "сор"), 2)
    ],
    'выносить': [
        (("роды", "износить", "обдумать"), 0),
        (("терпеть", "убирать", "доставка"), 2)
    ],
    'выноситься': [
        (("роды", "износить", "обдумать"), 0),
        (("терпеть", "убирать", "доставка"), 2)
    ],
    'высыпать': [
        (("сыпь", "выбежать", "убрать"), 0),
        (("спать", "отдых", "сон"), 2)
    ],
    'высыпаться': [
        (("сыпь", "выбежать", "убрать"), 0),
        (("спать", "отдых", "сон"), 2)
    ],
    'выходить': [
        (("вылечить", "обойти", "нянчить"), 0),
        (("уходить", "появиться"), 2)
    ],
    'вычитать': [
        (("читать", "сведение", "текст"), 0),
        (("отнимать", "вычитание"), 2)
    ],
    'вязанка': [
        (("вязать", "шерсть", "одежда"), 0),
        (("дрова", "рубить", "хворост"), 1)
    ],
    'гаванский': [
        (("гавань",), 0),
        (("куба", "столица"), 1)
    ],
    'голубить': [
        (("ласкать", "нежить", "лелеять"), 1),
        (("окрашивать", "цвет", "голубой"), 2)
    ],
    'горец': [
        (("гора", "житель"), 0),
        (("растение", "трава", "кустарник"), 1)
    ],
    'грабление': [
        (("уборка", "листья", "грабли"), 0),
        (("грабеж", "преступник", "разбой"), 1)
    ],
    'дама': [
        (("женщина", "карта", "девушка"), 0),
        (("ткань", "фасон", "шелк"), 1)
    ],
    'диаспора': [
        (("народ", "общность", "этнический"), 1),
        (("растение", "плод", "клубень"), 2)
    ],
    'добро': [
        (("ласково", "приветливо", "обнять"), 0),
        (("хороший", "удачно"), 1)
    ],
    'доброта': [
        (("добротность", "доброкачественность"), 1),
        (("доброжелательность", "отзывчивость"), 2)
    ],
    'довод': [
        (("соображение", "факт"), 0),
        (("доведение", "доводка"), 1)
    ],
    'доменный': [
        (("домна", "печь", "шахта"), 0),
        (("домен", "феодал", "владение"), 1)
    ],
    'допарить': [
        (("баня", "пропарка", "парка"), 1),
        (("летать", "долететь", "добраться"), 2)
    ],
    'досыпать': [
        (("добавить", "насыпать", "зерно"), 1),
        (("спать", "сон", "выспаться"), 2)
    ],
    'досыпаться': [
        (("добавить", "насыпать", "зерно"), 1),
        (("спать", "сон", "выспаться"), 2)
    ],
    'дохнуть': [
        (("умирать", "околевать"), 0),
        (("вдох", "выдох", "дышать"), 1)
    ],
    'жаление': [
        (("жалить", "ужалить", "жалиться"), 0),
        (("жалость", "сострадание", "успокаивать"), 1)
    ],
    'желудок': [
        (("орган", "пищеварение", "организм"), 1),
        (("желудь", "дуб"), 2)
    ],
    'желудочек': [
        (("орган", "пищеварение", "организм"), 1),
        (("желудь", "дуб"), 2)
    ],
    'забронированный': [
        (("бронирование", "забронировать", "закрепление"), 2),
        (("доспех", "война", "одежда"), 3)
    ],
    'забронировать': [
        (("бронирование", "забронировать", "закрепление"), 2),
        (("доспех", "война", "одежда"), 3)
    ],
    'забронироваться': [
        (("бронирование", "забронировать", "закрепление"), 2),
        (("доспех", "война", "одежда"), 3)
    ],
    'забухать': [
        (("стучать", "ударять", "грохотать"), 0),
        (("выпивать", "алкоголь", "пить"), 1)
    ],
    'заворот': [
        (("загиб", "перекручивание", "кишка"), 0),
        (("дорога", "изгиб", "поворот"), 1)
    ],
    'задохнуться': [
        (("затхлый", "испортиться"), 1),
        (("дышать", "умереть", "дым"), 2)
    ],
    'закликать': [
        (("кликать", "мышка", "кликание"), 1),
        (("звать", "зазывать", "глашатай"), 2)
    ],
    'замковый': [
        (("башня", 'стоять', "гора"), 0),
        (("щеколда", "открыть", "взломать"), 1)
    ],
    'замок': [
        (("башня", 'стоять', "гора"), 0),
        (("щеколда", "открыть", "взломать"), 1)
    ],
    'замыкать': [
        (("путешествовать", 'скитаться', "гулять"), 1),
        (("смыкать", "последний", "запирать"), 2)
    ],
    'замыкаться': [
        (("путешествовать", 'скитаться', "гулять"), 1),
        (("смыкать", "последний", "запирать"), 2)
    ],
    'замять': [
        (("метель", 'вьюга', "буран"), 0),
        (("сдавить", "отвлечь", "нажимать"), 1)
    ],
    'запасник': [
        (("запас", 'хранить', "музей"), 1),
        (("война", "солдат", "призвать"), 2)
    ],
    'запах': [
        (("обоняние", 'нюхать', "нос"), 0),
        (("одежда", "пальто", "закрыть"), 1)
    ],
    'запахнуть': [
        (("обоняние", 'нюхать', "нос"), 1),
        (("одежда", "пальто", "закрыть"), 2)
    ],
    'запона': [
        (("бляха", 'одежда', "украшение"), 0),
        (("передник", "фартук"), 1)
    ],
    'заспориться': [
        (("спор", 'проспорить', "пари"), 1),
        (("успешно", "удачно", "работа"), 2)
    ],
    'засыпать': [
        (("добавить", "насыпать", "зерно"), 1),
        (("спать", "сон", "выспаться"), 2)
    ],
    'засыпаться': [
        (("добавить", "насыпать", "зерно"), 1),
        (("спать", "сон", "выспаться"), 2)
    ],
    'затрусить': [
        (("испугаться", "смущение", "страх"), 1),
        (("бежать", "передвигаться", "быстро"), 2)
    ],
    'затыкать': [
        (("обращаться", "вонзать", "совать"), 1),
        (("закупоривать", "закрывать", "пробка"), 2)
    ],
    'здорово': [
        (("хорошо", "удачно", "сильно"), 0),
        (("полезно", "приветствие", "встреча"), 1)
    ],
    'зорить': [
        (("зрелость", "солнце", "ягода"), 0),
        (("разбой", "грабеж", "разорять"), 1)
    ],
    'избегать': [
        (("бегать", "место", "побывать"), 1),
        (("сторониться", "воздерживаться", "бояться"), 2)
    ],
    'ирис': [
        (("растение", "нитка", "цветок"), 0),
        (("конфета", "сладость", "кушать"), 1)
    ],
    'ирисовый': [
        (("растение", "нитка", "цветок"), 0),
        (("конфета", "сладость", "кушать"), 1)
    ],
    'искушать': [
        (("отведать", "съесть", "еда"), 1),
        (("соблазнять", "змея", "прельщать"), 2)
    ],
    'калига': [
        (("брюква", "растение", "садоводство"), 0),
        (("башмак", "обувь", "рим"), 1)
    ],
    'камора': [
        (("орудие", "снаряд", "война"), 0),
        (("знак", "рукопись", "славянский"), 1)
    ],
    'капельный': [
        (("капля", "дождь", "падать"), 0),
        (("капель", "снег", "таять"), 1)
    ],
    'карга': [
        (("отмель", "река", "плыть"), 0),
        (("старуха", "ворона", "сварливый"), 1)
    ],
    'кирка': [
        (("церковь", "лютеранство"), 0),
        (("шахта", "орудие", "копать"), 1)
    ],
    'киса': [
        (("кошка", "подзывать", "гладить"), 0),
        (("мешок", "суконный", "рюкзак"), 1)
    ],
    'колон': [
        (("ударение", "античность", "поэтика"), 0),
        (("валюта", "арендатор", "земля"), 1)
    ],
    'комплекс': [
        (("совокупность", "сочетание"), 0),
        (("математика", "умножение", "элемент"), 1)
    ],
    'комплексный': [
        (("совокупность", "сочетание"), 0),
        (("математика", "умножение", "элемент"), 1)
    ],
    'кондуктор': [
        (("травмвай", "транспорт", "автобус"), 1),
        (("офицер", "флот", "звание"), 2)
    ],
    'кондукторский': [
        (("травмвай", "транспорт", "автобус"), 1),
        (("офицер", "флот", "звание"), 2)
    ],
    'консерваторка': [
        (("демократия", "консерватизм", "консерватор"), 2),
        (("консерватория", "музыка", "женщина"), 3)
    ],
    'консерваторский': [
        (("демократия", "консерватизм", "консерватор"), 2),
        (("консерватория", "музыка"), 3)
    ],
    'кора': [
        (("скульптура", "женщина", "древнегреческий"), 0),
        (("дерево", "слой", "ствол"), 1)
    ],
    'кратер': [
        (("вулкан", "извержение", "лава"), 0),
        (("сосуд", "древнегреческий", "ваза"), 1)
    ],
    'кредит': [
        (("бухгалтерия", "расход"), 0),
        (("долг", "банк", "доверие"), 1)
    ],
    'крестовик': [
        (("растение", "рубль", "крест"), 1),
        (("паук", "ядовитый", "насекомое"), 2)
    ],
    'кули': [
        (("носильщик", "чернорабочий", "грузчик"), 0),
        (("пюре", "ягода", "фрукт"), 1)
    ],
    'кура': [
        (("курица", "животное", "ферма"), 0),
        (("вьюга", "метель", "буран"), 1)
    ],
    'ледник': [
        (("холодильник", "подвал", "скоропортящийся"), 0),
        (("лед", "полярный", "скопление"), 1)
    ],
    'ледниковый': [
        (("холодильник", "подвал", "скоропортящийся"), 0),
        (("лед", "полярный", "скопление"), 1)
    ],
    'маца': [
        (("типография", "печать"), 0),
        (("хлеб", "еврей", "лепешка"), 1)
    ],
    'мекать': [
        (("блеять", "нечленораздельно", "понимать"), 0),
        (("думать", "предполагать"), 1)
    ],
    'милование': [
        (("прощать", "вред", "отпустить"), 0),
        (("любовь", "ласкать", "целовать"), 2)
    ],
    'миловать': [
        (("прощать", "вред", "отпустить"), 0),
        (("любовь", "ласкать", "целовать"), 2)
    ],
    'миловаться': [
        (("прощать", "вред", "отпустить"), 0),
        (("любовь", "ласкать", "целовать"), 2)
    ],
    'мокрота': [
        (("гной", "легкие", "болезнь"), 1),
        (("сырость", "влажность", "дождь"), 2)
    ],
    'молодец': [
        (("герой", "храбрец", "молодой"), 0),
        (("похвалить", "одобрение", "умело"), 2)
    ],
    'морочный': [
        (("облачный", "пасмурный", "туманный"), 0),
        (("затяжной", "хлопотный", "канительный"), 1)
    ],
    'мука': [
        (("страдание", "мучение", "наказание"), 0),
        (("зерно", "хлеб", "мельница"), 1)
    ],
    'набухать': [
        (("налить", "чересчур", "переборщить"), 1),
        (("пухнуть", "переполнить", "увеличиваться"), 2)
    ],
    'навозить': [
        (("удобрять", "пачкать", "почва"), 1),
        (("привозить", "завозить", "поставка"), 2)
    ],
    'навозиться': [
        (("удобрять", "пачкать", "почва"), 1),
        (("привозить", "завозить", "поставка"), 2)
    ],
    'наволочный': [
        (("наволочка", "постель", "убирать"), 0),
        (("охота", "сеть", "птица"), 2)
    ],
    'наволочь': [
        (("облако", "туча", "туман"), 1),
        (("привозить", "собрать"), 2)
    ],
    'назубок': [
        (("напильник", "зубье", "выпиливать"), 1),
        (("наизусть", "вызубрить", "основательно"), 2)
    ],
    'нападать': [
        (("падать", "листья", "снег"), 1),
        (("нападение", "набрасываться", "вредить"), 2)
    ],
    'насыпать': [
        (("сыпучий", "рассыпать", "крупа"), 0),
        (("спать", "отдых", "сон"), 2)
    ],
    'натужиться': [
        (("напрячься", "стараться", "потеть"), 1),
        (("измучиться", "тужить"), 2)
    ],
    'недосыпать': [
        (("сыпучий", "рассыпать", "крупа"), 0),
        (("спать", "отдых", "сон"), 2)
    ],
    'недосыпаться': [
        (("сыпучий", "рассыпать", "крупа"), 0),
        (("спать", "отдых", "сон"), 2)
    ],
    'нудить': [
        (("принуждать", "заставлять"), 0),
        (("говорить", "скучный", "диалог"), 1)
    ],
}


def add_homographs():

    for hom in homographs:
        homograph, created = Homograph.objects.get_or_create(
            homograph=hom
        )
        if created:
            for quasi in homographs[hom]:
                QuasiSynonym.objects.create(
                    homograph=homograph,
                    stress=quasi[1],
                    synonyms=list(quasi[0])
                )
        print(f'Добавлен {hom}')


class Command(BaseCommand):
    help = 'Добавление омографов'

    def handle(self, *args, **options):

        add_homographs()
